In [39]:
# Add Matplotlib inline magic command
%matplotlib inline

In [40]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [41]:
# Import dependencies.
import matplotlib.pyplot as plt

In [42]:
import csv
import os

In [49]:
city_data_to_load = os.path.join ("Resources/city_data.csv")
ride_data_to_load = os.path.join ("Resources/ride_data.csv")

In [51]:
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [52]:
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head()

                 city           date   fare       ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12
4          South Jack    3/6/19 4:28  34.58  3.908450e+12

In [54]:
#Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [55]:
# Get data types in each columns
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [56]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [57]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [58]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [59]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [60]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [61]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.908450e+12            46  Urban